---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.GetMacroManager(Autodesk.Revit.UI.UIApplication)
source: html/5eb36b4d-b15c-c638-a16a-a4a5511456fc.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.GetMacroManager Method

Gets the UI Macro manager from the UI application.

## Syntax (C#)
```csharp
public static UIMacroManager GetMacroManager(
	UIApplication application
)
```

## Parameters
- **application** (`Autodesk.Revit.UI.UIApplication`) - The UI application.

## Returns
The new UI Macro manager object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was NULL